#include "header.h"

//시작 선택 화면
void start(){
	printf("시작 화면\n");
	printf("--------------------\n\n");
	printf(" 1. 회원가입\n\n");
	printf(" 2. 로그인\n\n");
	printf("-1. 프로그램 종료\n\n");  
	printf("--------------------\n\n");
	printf("원하는 작업을 입력 하세요 : ");
}

//회원가입
void join(){
	printf("회원가입\n");
	printf("--------------------\n\n");
	printf("1. ID : \n\n");
	printf("2. PW : \n\n");
	printf("3. Name : \n\n");
	printf("--------------------\n\n");
}

//로그인
void login(){
	printf("로그인\n");
	printf("--------------------\n\n");
	// printf("1. ID : \n\n");
	// printf("2. PW : \n\n");
	// printf("--------------------\n\n");
}

//로그인 성공시
void ls(){
	printf("--------------------\n\n");
	printf("1. 채팅방  \n\n");
	printf("2. 게시판  \n\n");
	printf("--------------------\n\n");
	printf("원하는 작업을 입력 하세요 : ");
}

//채팅방
void chatroom(){
	printf(" 채팅방\n");
	printf("--------------------\n\n");
	printf("1. 전체 채팅방  \n\n");
	printf("2. 팔로우한 채팅방  \n\n");
	printf("3. 채팅방 검색  \n\n");
	printf("--------------------\n\n");
	printf("원하는 작업을 입력 하세요 : ");
}

//게시판
void board(){
	printf("게시판\n");
	printf("--------------------\n\n");
	printf("1. 자유 게시판  \n\n");
	printf("2. 정보 게시판  \n\n");
	printf("3. 홍보 게시판  \n\n");
	printf("--------------------\n\n");
	printf("원하는 작업을 입력 하세요 : ");
}

//전체 채팅방
void allchatroom(){
	printf("전체 채팅방\n");
	printf("--------------------\n\n");
	printf("1. \n\n");
	printf("2. \n\n");
	printf("3. \n\n");
	printf("--------------------\n\n");
}

//팔로우한 채팅방
void followchatroom(){
	printf("팔로우한 채팅방\n");
	printf("--------------------\n\n");
	printf("1. \n\n");
	printf("2. \n\n");
	printf("3. \n\n");
	printf("--------------------\n\n");
}

//채팅방 검색
void chatroomsearch(){
	printf("채팅방 검색\n");
	printf("--------------------\n\n");
	printf("검색 할 수업명을 입력하세요 : \n\n");
	printf("--------------------\n\n");
}

//게시글 목록
void post1(){
	printf("--------------------\n\n");
	printf("Title \n\n");
	printf("Title \n\n");
	printf("--------------------\n\n");
	printf("1. 글쓰기 \n\n");
}

//게시글
void post2(){
	printf("--------------------\n\n");
	printf("1. Title \n\n");
	printf("Description \n\n");
	printf("--------------------\n\n");
	printf("Comment \n\n");
	printf("1. Comment \n\n");
}

//게시글 작성
void mkpost() {
	printf("게시글 작성\n");
	printf("--------------------\n\n");
	printf("1. Title : \n\n");
	printf("2. Description : \n\n");
	printf("--------------------\n\n");
}

//LECTIO 로고 print
void start_1() {
  printf("-----------------------------------------------------------\n");
  printf("------#-------######---#####----#######---###-----####-----\n");
  printf("-----#-------#-------##-----------#-------#-----#----#-----\n");
  printf("----#-------######--#------------#-------#-----#----#------\n");
  printf("---#-------#-------##-----------#-------#-----#----#-------\n");
  printf("--######--######----#####------#------###-----####---------\n");
  printf("-----------------------------------------------------------\n");
  sleep(1);
  system("clear");
  start_2();
}

void start_2() {
  printf("                                                           \n");
  printf("------#-------######---#####----#######---###-----####-----\n");
  printf("-----#-------#-------##-----------#-------#-----#----#-----\n");
  printf("----#-------######--#------------#-------#-----#----#------\n");
  printf("---#-------#-------##-----------#-------#-----#----#-------\n");
  printf("--######--######----#####------#------###-----####---------\n");
  printf("-----------------------------------------------------------\n");
  sleep(1);
  system("clear");
  start_3();
}

void start_3() {
  printf("                                                           \n");
  printf("      #       ######   #####    #######   ###     ####     \n");
  printf("-----#-------#-------##-----------#-------#-----#----#-----\n");
  printf("----#-------######--#------------#-------#-----#----#------\n");
  printf("---#-------#-------##-----------#-------#-----#----#-------\n");
  printf("--######--######----#####------#------###-----####---------\n");
  printf("-----------------------------------------------------------\n");
  sleep(1);
  system("clear");
  start_4();
}

void start_4() {
  printf("                                                          \n");
  printf("      #       ######   #####    #######   ###     ####    \n");
  printf("     #       #       ##           #       #     #    #    \n");
  printf("----#-------######--#------------#-------#-----#----#------\n");
  printf("---#-------#-------##-----------#-------#-----#----#-------\n");
  printf("--######--######----#####------#------###-----####---------\n");
  printf("-----------------------------------------------------------\n");
  sleep(1);
  system("clear");
  start_5();
}

void start_5() {
  printf("                                                          \n");
  printf("      #       ######   #####    #######   ###     ####    \n");
  printf("     #       #       ##           #       #     #    #    \n");
  printf("    #       ######  #            #       #     #    #     \n");
  printf("---#-------#-------##-----------#-------#-----#----#-------\n");
  printf("--######--######----#####------#------###-----####---------\n");
  printf("-----------------------------------------------------------\n");
  sleep(1);
  system("clear");
  start_6();
}

void start_6() {
  printf("                                                          \n");
  printf("      #       ######   #####    #######   ###     ####    \n");
  printf("     #       #       ##           #       #     #    #    \n");
  printf("    #       ######  #            #       #     #    #     \n");
  printf("   #       #       ##           #       #     #    #      \n");
  printf("--######--######----#####------#------###-----####---------\n");
  printf("-----------------------------------------------------------\n");
  sleep(1);
  system("clear");
  start_7();
}

void start_7() {
  printf("                                                          \n");
  printf("      #       ######   #####    #######   ###     ####     \n");
  printf("     #       #       ##           #       #     #    #     \n");
  printf("    #       ######  #            #       #     #    #      \n");
  printf("   #       #       ##           #       #     #    #       \n");
  printf("  ######  ######    #####      #      ###     ####         \n");
  printf("-----------------------------------------------------------\n");
  sleep(1);
  system("clear");
  start_8();
}

void start_8() {
  printf("                                                          \n");
  printf("      #       ######   #####    #######   ###     ####     \n");
  printf("     #       #       ##           #       #     #    #     \n");
  printf("    #       ######  #            #       #     #    #      \n");
  printf("   #       #       ##           #       #     #    #       \n");
  printf("  ######  ######    #####      #      ###     ####         \n");
  printf("                                                           \n");
  system("clear");
}

void logo_head() {
  printf("┎──────────────────────────────────────────────────────────────────────────────┒\n");
  printf("┃                                                                              ┃\n");
  printf("┃                #       ######   #####    #######   ###     ####              ┃\n");
  printf("┃               #       #       ##           #       #     #    #              ┃\n");
  printf("┃              #       ######  #            #       #     #    #               ┃\n");
  printf("┃             #       #       ##           #       #     #    #                ┃\n");
  printf("┃            ######  ######    #####      #      ###     ####                  ┃\n");
  printf("┃                                                                              ┃\n");
  printf("┃                                                                              ┃\n");
  printf("┃                                                                              ┃\n");
  printf("┃                                                  Created by 5 Team           ┃\n");
  printf("┃                                                   Koo, Ahn, Song, Han        ┃\n");
  printf("┃                                                                              ┃\n");
  printf("┖──────────────────────────────────────────────────────────────────────────────┚\n");
}